<template>
  <div>
    <h4 class="title">关于登录功能的隐私说明</h4>
    <br>
    <p>首先，这个弹幕姬是非官方项目。由于B站并没有提供开放API供用户登录第三方应用，目前需要使用cookie记录用户登录态。</p>
    <p>登录功能直接通过官方的登录页实现(因此也支持扫码登录)，在用户成功登录后，会获取并在本地保存用户的cookie，也就是说在cookie过期后用户还需要手动的重新登录。</p>
    <h4>弹幕姬不会记录用户的账户密码，也不会上传用户的cookie信息。</h4>
    <p>在登录成功后，会向我的统计服务器发送一条统计信息，其中包括当前使用的弹幕姬版本、用户的UID(可在该用户的个人空间看到)和直播房间号。收集这部分信息可以让我更好地了解到弹幕姬的使用及更新情况</p>
    <p>登录后可使用需要用户态的部分功能如直播间管理、禁言用户、任命房管、弹幕发送等。<br>
      弹幕姬核心功能、点歌板、统计等功能完全无需登录态。
    </p>
  </div>
</template>

<style lang="stylus" scoped>


</style>
