<template>
  <div>
    <h4 class="title">关于登录功能的隐私说明</h4>
    <p>首先我必须要说，登录功能使用了官方的登录页面，但并没有官方授权。</p>
    <p>在用户登录后，我会在本地保存用户的cookie，也就是说在cookie过期后用户还需要手动的重新登录。</p>
    <p>
      <br>
      在登录成功后，会向我的统计服务器发送一条统计信息，其中包括用户的UID和房间号。<br>
      这两条信息可以在个人空间被所有人看到，我会用于统计使用人数。<br>
      弹幕姬不会记录用户的账号及密码，单纯使用cookie也没有办法修改账号的密码。<br>
      登录后可使用需要用户态的部分功能如直播间管理、禁言用户、任命房管、弹幕发送等。<br>
      弹幕接受、点歌板、统计等功能完全无需登录态。
    </p>
  </div>
</template>

<style lang="stylus" scoped>
section
  padding 0
  margin 0
</style>
